{
  "categoriesProduct": [
    {
      "id": "1",
      "name": "Trái cây",
      "image": "taophap1.webp"
    },
    {
      "id": "2",
      "name": "Rau củ",
      "image": "caiboxoi1.webp"
    },
    {
      "id": "3",
      "name": "Thịt cá hải sản",
      "image": "monggio1.jpg"
    },
    {
      "id": "4",
      "name": "Ngũ cốc, đậu, hạt",
      "image": "ngucoc1.png"
    },
    {
      "id": "5",
      "name": "Thức uống",
      "image": "suaym1.jpg"
    },
    {
      "id": "6",
      "name": "Sản phẩm chế biến",
      "image": "banhmi1.png"
    },
    {
      "id": "7",
      "name": "Gia vị",
      "image": "sotca1.jpg"
    },
    {
      "id": "6240",
      "name": "Tiến Diên",
      "image": {}
    },
    {
      "id": "b482",
      "name": "Chinh Nguyen",
      "image": {}
    },
    {
      "id": "b279",
      "name": "ftp",
      "image": "pk.jpg"
    },
    {
      "id": "ed5c",
      "name": "ddd",
      "image": ""
    },
    {
      "id": "9053",
      "name": "ss",
      "image": "banhmi2.png"
    },
    {
      "id": "3baf",
      "name": "Chinh Nguyen",
      "image": "cam1.webp"
    },
    {
      "id": "ca85",
      "name": "Chinh Nguyen",
      "image": "cam1.webp"
    },
    {
      "id": "d0f4",
      "name": "Chinh Nguyen",
      "image": "cam1.webp"
    },
    {
      "id": "6184",
      "name": "",
      "image": ""
    },
    {
      "id": "c191",
      "name": "Tiến Diên",
      "image": "bo2.webp"
    }
  ],
  "products": [
    {
      "id": "1",
      "category": 1,
      "name": "Táo kẹo candine organic Pháp",
      "price": 79500,
      "orgPrice": 90000,
      "quantity": 100,
      "likes": 0,
      "purchased": 0,
      "mass": "1kg",
      "images": ["taophap1.webp", "taophap2.png"],
      "description": "Nếu táo Fuji “đốn tim” bạn với chất thịt dày ngọt, táo Ariane “mê hoặc” bạn với độ giòn và thơm đặc trưng, thì Candine hữu cơ chính là giống táo có sự giao thoa một cách tinh tế giữa Fuji và Ariane, được thừa hưởng những điểm mạnh của hai loại táo này. Nhờ vậy, Táo Candine Organic có sắc đỏ sáng bóng, thịt táo mọng nước cùng độ giòn ngọt mà chúng ta khó có thể tìm được sự kết hợp đó ở những giống táo khác."
    },
    {
      "id": "2",
      "category": 1,
      "name": "Táo envy New Zealand",
      "price": 124500,
      "orgPrice": 130000,
      "quantity": 100,
      "likes": 0,
      "purchased": 0,
      "mass": "1kg",
      "images": ["taoenvy1.webp", "taoenvy2.jpg", "taoenvy3.jpg"],
      "description": "Envy có quả to tròn, với vỏ màu đỏ điểm thêm các sọc màu vàng Envy  mang trong mình vị ngọt tự nhiên, hương thơm quyến rũ cùng vị giòn tan khiến bạn không thể cưỡng lại được. Táo Envy là một loại trái cây nhập khẩu quen thuộc với mọi người. Được biết đến là giống táo thơm ngon bậc nhất thế giới, táo Envy còn rất tốt cho sức khỏe vời nhiều giá trị dinh dưỡng bất ngờ."
    },
    {
      "id": "3",
      "category": 2,
      "name": "Ớt chuông đỏ Organic",
      "price": 28000,
      "orgPrice": 35000,
      "quantity": 100,
      "likes": 0,
      "purchased": 0,
      "mass": "1kg",
      "images": ["otchuong1.webp", "otchuong2.webp", "otchuong3.webp"],
      "description": "Ớt Chuông có nhiều màu như xanh, đỏ, cam, vàng, thân tròn như quả chuông, hương thơm, vị rất giòn ngọt, ít hăng. CÔNG DỤNG • Ớt Chuông giàu Vitamin A, K, C, Kali, Magne, chất khoáng và chất xơ. Hổ trợ tiêu hóa, tốt cho mắt, hệ miễn dịch cao, giảm đường và cholesterol trong máu. Kích thích tuần hoàn máu, ngăn ngừa lão hóa. • Ngoài việc kích thích ngon miệng, nó còn bổ sung canxi và ngăn chặn ung thư khá cao. CÁCH SỬ DỤNG • Trộn salát, ăn tươi sống hoặc xào."
    },
    {
      "id": "4",
      "category": 2,
      "name": "Cải bó xôi Organic",
      "price": 68000,
      "orgPrice": 75000,
      "quantity": 100,
      "likes": 0,
      "purchased": 0,
      "mass": "1kg",
      "images": ["caiboxoi1.webp", "caiboxoi2.webp", "caiboxoi3.png"],
      "description": "Cải bó xôi còn có tên là rau bina, rau chân vịt, là loại rau được trồng phổ biến ở nước ta. Đây là loại rau thường được sử dụng trong chế biến món ăn hoặc ép nước để uống và có giá trị dinh dưỡng cao. Rau bina được xem như là một 'siêu thực phẩm' nhờ có nguồn vitamin và khoáng chất tuyệt vời đối với sức khỏe."
    },
    {
      "id": "5",
      "category": 2,
      "name": "Rau cần tây Organic",
      "price": 55000,
      "orgPrice": 65000,
      "quantity": 100,
      "likes": 0,
      "purchased": 0,
      "mass": "1kg",
      "images": ["cantay1.webp", "cantay2.jpg", "cantay3.jpg"],
      "description": "Cải bó xôi còn có tên là rau bina, rau chân vịt, là loại rau được trồng phổ biến ở nước ta. Đây là loại rau thường được sử dụng trong chế biến món ăn hoặc ép nước để uống và có giá trị dinh dưỡng cao. Rau bina được xem như là một 'siêu thực phẩm' nhờ có nguồn vitamin và khoáng chất tuyệt vời đối với sức khỏe."
    },
    {
      "id": "6",
      "category": 3,
      "name": "Móng giò Karst Premium",
      "price": 159000,
      "orgPrice": 170000,
      "quantity": 100,
      "likes": 0,
      "purchased": 0,
      "mass": "1kg",
      "images": [
        "monggio1.jpg",
        "monggio2.png",
        "monggio3.png",
        "monggio4.png"
      ],
      "description": "Thức ăn của heo, gà là cám gạo, bột cá biển trộn với rau cắt nhỏ (rau lang, rau muống, chuối tự trồng và đặc biệt bổ sung tảo xoắn). Tất cả nguyên liệu được ủ cùng men vi sinh Probiotic trong 24 giờ. Hằng ngày, heo và gà trong chăn trại được chăn thả tự do với nguồn thức ăn khép kín và đồng thời được uống bổ sung men vi sinh Probiotic để tăng cường đề kháng và phòng dịch bệnh triệt để."
    },
    {
      "id": "7",
      "category": 3,
      "name": "Sườn non Karst Premium",
      "price": 220000,
      "orgPrice": 235000,
      "quantity": 100,
      "likes": 0,
      "purchased": 0,
      "mass": "500g",
      "images": [
        "suonnon1.jpg",
        "suonnon2.png",
        "suonnon3.png",
        "suonnon4.png"
      ],
      "description": "Thức ăn của heo, gà là cám gạo, bột cá biển trộn với rau cắt nhỏ (rau lang, rau muống, chuối tự trồng và đặc biệt bổ sung tảo xoắn). Tất cả nguyên liệu được ủ cùng men vi sinh Probiotic trong 24 giờ. Hằng ngày, heo và gà trong chăn trại được chăn thả tự do với nguồn thức ăn khép kín và đồng thời được uống bổ sung men vi sinh Probiotic để tăng cường đề kháng và phòng dịch bệnh triệt để."
    },
    {
      "id": "8",
      "category": 4,
      "name": "Ngũ cốc giòn Muesli mix trái cây hữu cơ",
      "price": 220000,
      "orgPrice": 235000,
      "quantity": 100,
      "likes": 0,
      "purchased": 0,
      "mass": "350g",
      "images": ["ngucoc1.png", "ngucoc2.png", "ngucoc3.png"],
      "description": "Thức ăn của heo, gà là cám gạo, bột cá biển trộn với rau cắt nhỏ (rau lang, rau muống, chuối tự trồng và đặc biệt bổ sung tảo xoắn). Tất cả nguyên liệu được ủ cùng men vi sinh Probiotic trong 24 giờ. Hằng ngày, heo và gà trong chăn trại được chăn thả tự do với nguồn thức ăn khép kín và đồng thời được uống bổ sung men vi sinh Probiotic để tăng cường đề kháng và phòng dịch bệnh triệt để."
    },
    {
      "id": "9",
      "category": 5,
      "name": "Sữa yến mạch cacao hữu cơ Riso Scotti",
      "price": 110000,
      "orgPrice": 115000,
      "quantity": 100,
      "likes": 0,
      "purchased": 0,
      "mass": "1 lít",
      "images": ["suaym1.jpg", "suaym2.jpg"],
      "description": "Thành phần: Nước, yến mạch hữu cơ (16%), bột cacao hữu cơ (1,5%), siro agave hữu cơ (1,5%) dầu hoa hướng dương, tảo biển đỏ Lithothamnium, chất ổn định carrageenan, xanthan, gum), muối. Sản phẩm có chứa Gluten."
    },
    {
      "id": "10",
      "category": 6,
      "name": "Bánh mì cuộn Finger hữu cơ",
      "price": 70000,
      "orgPrice": 82000,
      "quantity": 100,
      "likes": 0,
      "purchased": 0,
      "mass": "1 cái",
      "images": ["banhmi1.png", "banhmi2.png", "banhmi3.png"],
      "description": "Bột mì hữu cơ, nước, men, bột lúa mạch đen hữu cơ nướng, bột lúa mạch đen hữu cơ (1,9%), muối ăn không iốt, hạt lanh hữu cơ (1,8%), bột đậu nành hữu cơ (1,6%), cám lúa mì hữu cơ, lúa mì hữu cơ gluten, bột ngô hữu cơ, bột mì mạch nha hữu cơ, hạt caraway hữu cơ, rau mùi hữu cơ, thì là hữu cơ, chất ổn định: guar gum."
    },
    {
      "id": "11",
      "category": 4,
      "name": "Ngũ cốc Granola 10% yến mạch, 90% hạt",
      "price": 140000,
      "orgPrice": 145000,
      "quantity": 100,
      "likes": 0,
      "purchased": 0,
      "mass": "500g",
      "images": ["ngucochat1.jpg", "ngucochat2.jpg", "ngucochat3.jpg"],
      "description": "Granola mix loại hạt siêu nhiều hạt hỗ trợ giảm cân rất tốt. Ăn ngon và no lâu ăn kiêng nhưng bổ sung đầy đủ chất. Tạo cảm giác được ăn đầy đủ nên ít thèm ăn. Khi đói, buồn miệng ăn granola tạo cảm giác no lâu từ đó hỗ trợ giảm cân, giải quyết những lúc đói thèm ăn khi nhịn ăn với chế độ khắc khe. Granola có thể ăn kèm sữa chua, sữa tươi, trái cây, sinh tố, hoặc ăn vã không đã ngon lắm rồi. Các loại hạt thơm bùi giòn tan xen lẫn vị chua nhẹ từ Nam việt quất và ngòn ngọt thơm thanh của nho vàng khô, mật ong, nếu đã lỡ ăn bạn sẽ không cưỡng lại được. Nếu bạn không quen ăn các loại đậu hạt, ăn từng món nguyên hạt thì hãy ăn thử granola bạn sẽ ước mình biết nó sớm hơn."
    },
    {
      "id": "12",
      "category": 7,
      "name": "Muối biển siêu sạch Byodo",
      "price": 175000,
      "orgPrice": 188000,
      "quantity": 100,
      "likes": 0,
      "purchased": 0,
      "mass": "1kg",
      "images": ["muoibien1.png", "muoibien2.jpg"],
      "description": "Muối biển hảo hạng không chỉ là muối – nguồn gốc và loại muối sản xuất mới là yếu tố quyết định. Muối biển càng tinh khiết càng quý. Vàng trắng! hạt mịn không iốt. Đảm bảo không có bất kỳ chất phụ gia nào cung cấp các khoáng chất và nguyên tố vi lượng quan trọng Muối biển hảo hạng của Byodo, dạng hạt mịn, rất lý tưởng để nấu và nêm gia vị cho các món ăn hảo hạng và là sản phẩm cần có trong mọi căn bếp dành cho người sành ăn. Khi bắt đầu sản xuất, nước mặn được làm sạch và chứa đầy nước biển bằng máy bơm. Nước biển được chuyển từ hồ này sang hồ khác trong khoảng thời gian vài tháng. Dưới tác động của nắng và gió, nứớc biển bốc hơi và để lại một lớp muối tinh khiết. Ngay sau đó, nó được thu hoạch."
    },
    {
      "id": "13",
      "category": 7,
      "name": "Dầu quả bơ ép thô hữu cơ (RAW) IL Nutrimento",
      "price": 455000,
      "orgPrice": 460000,
      "quantity": 100,
      "likes": 0,
      "purchased": 0,
      "mass": "250 ml",
      "images": ["daubo1.jpg", "daubo2.jpg"],
      "description": "Dầu Bơ của Il Nutrimento là một loại dầu thô, thu được mà không cần làm nóng bơ hoặc máy ép trước khi ép, và không cần thêm nhiệt trong quá trình chiết xuất. Được lấy từ những quả bơ ngon ngọt được tuyển chọn kĩ càng và đã được gọt vỏ trước đó."
    },
    {
      "id": "14",
      "category": 7,
      "name": "Sốt cà chua Ý hữu cơ Sottolestelle",
      "price": 95000,
      "orgPrice": 97000,
      "quantity": 100,
      "likes": 0,
      "purchased": 0,
      "mass": "420g",
      "images": ["sotca1.jpg", "sotca2.jpg", "sotca3.jpg"],
      "description": "Cà chua được mệnh danh là một nhà máy dinh dưỡng vì nó cung cấp rất nhiều thành phần có lợi cho sức khỏe. Cà chua rất giàu vitamin A, C, K, vitamin B6, kali, folate, thiamin, magiê, niacin, đồng và phốt pho, là những vi chất cần thiết để duy trì một sức khỏe tốt. Cà chua chứa rất ít carbohydrate nên giúp làm giảm lượng đường trong máu. Cà chua có chứa vitamin K và canxi giúp giữ cho xương của bạn khỏe mạnh và chống loãng xương. Nước sốt cà chua giàu chất chống oxy hóa có ích cho probiotic trong đường ruột Các chất chống oxy hóa từ nước sốt cà chua đã làm tăng tác dụng tích cực của Lactobacillus reuteri. Và nước sốt cà chua nấu chín hiệu quả nhất. Nấu chín nước sốt cà chua làm biến đổi sự hiện diện của lycopene trong cà chua (quá trình đồng phân cis-trans), từ đó giúp duy trì tính toàn vẹn của chất chống oxy hóa này khi bị tiêu hóa, cho phép cơ thể nhận hấp thụ nhiều hơn."
    },
    {
      "id": "15",
      "category": 1,
      "name": "Bơ 034 canh tác hữu cơ",
      "price": 107000,
      "orgPrice": 110000,
      "quantity": 100,
      "likes": 0,
      "purchased": 0,
      "mass": "1kg",
      "images": ["bo1.webp", "bo2.webp", "bo3.jpg"],
      "description": "Theo các chuyên gia, tốt nhất nên dùng bơ trước bữa ăn từ 1 – 2 tiếng để giảm cân, ăn sau bữa ăn 1 – 2 tiếng nếu bạn muốn tăng cân. Bơ 034 ngon nhất khi chín dùng ngay. Bạn có thể dùng muỗng để nạo thịt hoặc lột vỏ, cắt bơ thành từng miếng vừa ăn."
    },
    {
      "id": "16",
      "category": 1,
      "name": "Cam sành vĩnh long",
      "price": 50000,
      "orgPrice": 52000,
      "quantity": 100,
      "likes": 0,
      "purchased": 0,
      "mass": "1kg",
      "images": ["cam1.webp", "cam2.webp", "cam3.jpg"],
      "description": "Vitamin C bảo vệ cơ thể bằng rất nhiều cách, chủ yếu qua các chức năng như chống oxy hóa, tổng hợp collagen, hệ tim mạch, hệ miễn dịch..… Nguồn vitamin C có nhiều trong các loại trái cây như cam, quýt, ổi xanh, dâu tây, cà chua, khoai lang, khoai tây, bông cải xanh, ớt xanh. Ai cũng biết cam là loại quả ngon và cung cấp một lượng vitamin C phong phú được các bà nội trợ tin dùng. Tuy nhiên, cam còn là một vị thuốc chữa bệnh tuyệt vời. Người ta tính ra trong mỗi 100 gram quả cam có chứa 88,8 g nước, 585 microgram carotene – một loại vitamin chống oxy hóa, 40 mg vitamin C, 108 mg kali, 34 mg canxi. Ngoài ra, với trọng lượng cam tương tự còn có chứa 1,4 g chất xơ,23 mg photpho, 0,4 mg sắt và giá trị năng lượng là 37 Kcal."
    }
  ],
  "categoriesBlog": [
    {
      "id": "1",
      "name": "Giữ dáng"
    },
    {
      "id": "2",
      "name": "Sức khỏe"
    },
    {
      "id": "3",
      "name": "Kiến thức"
    }
  ],
  "blogs": [
    {
      "id": "1",
      "thumbnail": "blog1.webp",
      "createAt": "2023-11-22T00:00:00.000Z",
      "comments": 13,
      "title": "Bí quyết ăn kiêng bằng bánh mì của phụ nữ Pháp",
      "category": 1,
      "contents": "Nếu đang bước đầu 'làm quen' với việc giảm cân và kiểm soát khẩu phần ăn thì bánh mì là lựa chọn hàng đầu dành cho bạn. Đơn giản là vì lượng calorie có trong bánh mì ít hơn lượng calorie bạn cần tiêu thụ mỗi ngày. Nghiên cứu cho thấy bánh mì làm từ bột mì trắng, bột tinh chế có thể gây tăng cân và béo bụng nhưng bánh mì nguyên hạt thực sự có thể giúp giảm cân."
    },
    {
      "id": "2",
      "thumbnail": "blog2.png",
      "createAt": "2024-01-02T17:00:00.000Z",
      "comments": 10,
      "category": 2,
      "title": "Ăn rau củ quả như thế nào là đủ?",
      "contents": "Theo thông tin từ Viện Dinh dưỡng quốc gia, người Việt đang ăn thịt nhiều gấp đôi so với mức khuyến nghị. Cụ thể, trung bình một người tiêu thụ 134 gram thịt/ngày, trong khi con số Tổ chức Phòng chống Ung thư Thế giới đưa ra không vượt quá 70 gram/ngày. Đáng chú ý là song song với tiêu thụ thừa thịt, người Việt còn đang có xu hướng… ngại ăn rau."
    },
    {
      "id": "3",
      "thumbnail": "blog3.jpg",
      "createAt": "2024-03-01T00:00:00.000Z",
      "comments": 10,
      "category": 3,
      "title": "Rau sạch là gì và cách để phân biệt với rau bẩn",
      "contents": "Bữa ăn của người Việt thường đi kèm với nhiều loại rau được chế biến theo nhiều cách khác nhau. Vì thế, khi có những vụ việc làm rau bẩn làm giả rau sạch, người tiêu dùng rất bức xúc và hoang mang. Trong bài viết này, Prudential sẽ giúp người tiêu dùng hiểu rõ hơn về rau sạch và rau bẩn cũng như đưa ra các mẹo để phân biệt rau."
    }
  ],
  "users": [
    {
      "id": "1",
      "role": 1,
      "name": "Chính Nguyễn",
      "phoneNumber": "0999888777",
      "email": "chinhnguyennn24@gmail.com",
      "address": "Go Vap, HCM"
    },
    {
      "id": "2",
      "role": 2,
      "name": "Van Dao",
      "phoneNumber": "0897676545",
      "email": "daotien@gmail.com",
      "address": "Tan Binh, HCM"
    },
    {
      "id": "3",
      "role": 2,
      "name": "Ngoc Lan",
      "phoneNumber": "0812212345",
      "email": "lanlan@gmail.com",
      "address": "Quan 1, HCM"
    }
  ],
  "roles": [
    {
      "id": "1",
      "name": "admin"
    },
    {
      "id": "2",
      "name": "user"
    }
  ]
}
